#+TITLE: septiembre 28, 2021 (martes)
** TSR
#+begin_src js
function sums (a,f){
    let b = []
    let acc = a[0]
    b.push(acc)
    for (i = 1; i<a.length; i++){
        acc = f(acc,a[i])
        b.push(acc)
    }
    return b
}

let array = [2,3,4,1];
console.log(sums(array,(a,b)=>a*b))
#+end_src

#+RESULTS:
: [2,6,24,24]

#+begin_src js
function fs(f){
    return a => {
        let b = []
        let acc = a[0]
        b.push(acc)
        for (i = 1; i<a.length; i++){
            acc = f(acc,a[i])
            b.push(acc)
        }
        return b
    }
}

let array = [2,3,4,1];
const sums = fs((a,b)=>a*b)
console.log(sums(array))
#+end_src

#+RESULTS:
: [2 , 6 , 24 , 24)]

*** Eventos
#+begin_src js
const ev = require('events')
const emisor = new ev.EventEmitter
emisor.on('event', (i)=> {
  console.log('Llego el evento ' + i)
})
emisor.emit('event',1)
emisor.emit('event',2)
#+end_src

#+RESULTS:
: Llego el evento 1
: Llego el evento 2
: undefined

** BDA
*** Introducción SQL
*** SELECT. Consultas sencillas sobre una tabla
#+begin_src sql
--Nombre y edad de todos los ciclistas
SELECT
FROM
#+end_src
** ISW
*** TODO Caso de estudio
